Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/index.html.txt.tmx
Source language: en
Languages: ga

source: Employment law gives employees various entitlements to leave from work ranging from holidays to parental leave
ga: Soláthraíonn an dlí fostaíochta teidlíochtaí áirithe saoirí ón obair d'fhostaithe ó laethanta saoire go dtí saoire do thuismitheoirí

source: Find out how your leave is calculated
ga: Faigh amach conas do shaoire a ríomh

source: Sick leave and sick pay
ga: Saoire bhreoiteachta agus pá breoiteachta

source: Your entitlement to paid sick leave from employment will depend on your contract of employment
ga: Tá do theidlíocht saoire le pá ó fhostaíocht ag brath ar do chonradh fostaíochta

source: Other types of leave from work
ga: Saoire eile ó fhostaíocht

source: The law gives an employee a limited right to leave from work in time of family crisis (force majeure)
ga: Tá ceart dleathach teoranta ag fostaithe a gcuid oibre a fhágáil ar feadh tréimhse, an fhaid is atá géarchéim clainne ar siúl

source: Find out about compassionate leave, jury service and career breaks
ga: Faigh eolas anseo ar shaoire trua agus ar chonas iarratas a dhéanamh

source: This gives a list of the nine public holidays and describes employees' entitlement to paid time off for these
ga: Liosta de na 9 gcinn de laethanta saoire phoiblí. Bíonn tromlach na bhfostaithe i dteideal saoire le pá ar na laethanta saoire phoiblí

source: The Parental Leave Act 1998 as amended by the Parental Leave (Amendment) Act 2006 allows parents to take parental leave in respect of certain children
ga: Ceadaíonn an tAcht um Shaoire do Thuismitheoirí 1998, agus é leasaithe ag an Acht um Shaoire do Thuismitheoirí (Leasú) 2006, saoire tuismitheora do thuismitheoirí i leith leanaí áirithe a fháil

source: The Carers Leave Act 2001 allows employees to take unpaid time off work to provide full-time care for people that require this care
ga: Tugann An tAcht um Shaoire Cúramóra, 2001 cead d'fhostaithe saoire a ghlacadh ón obair gan íocaíocht ionas go mbeidh ar a gcumas cúram lánaimseartha a thabhairt do dhaoine a bhfuil an cúram seo de dhíth orthu

source: All female employees are entitled to maternity leave from work immediately before and after the birth of their child
ga: Tá fostaithe mná i dteideal saoire mháithreachais, roimh agus i ndiaidh breithe a leanbh. Sonraí breise ar fáil anseo

source: People who adopt children may be entitled to leave from employment
ga: Is féidir le daoine a uchtaíonn leanaí, saoire oibre a thógáil

source: This leave is called adoptive leave
ga: Tugtar saoire uchtaíoch ar seo. Cad is brí le seo?

source: Find out what this means and how to apply
ga: Agus conas is féidir leat iarratas a chur isteach ar shaoire uchtaíoch?

source: Information about statutory paternity leave, which is available from September 2016
ga: Faisnéis faoi shaoire atharthachta reachtúil a bheidh ar fáil d’aithreacha nua ó Mheán Fómhair 2016

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
